Tekla Open API Reference for Tekla Structures 2025
ShapeItem Properties
The ShapeItem type exposes the following members.
Properties
Name | Description
BrepType
 Defines BrepType of shapes. @see enum BrepType
Extrema
 The extrema of the shape as an axis-aligned bounding box, as opposed to object-aligned
Fingerprint
 A fingerprint value calculated by Tekla Structures to provide quick comparison of geometries to avoid inserting same shape multiple times to the catalog. More rigorous comparison is done only for geometries that result in identical fingerprints.
GeometryGuid
 A unique identifier of the shape geometry, given initially by BrepStorage. This GUID is used as the body of the filename for the shape geometry information found in the ShapeGeometries directory
GeometryHash
 This obsolete property can still be used to store and externally provided unique hash value identifying the shape. However, Tekla Structures does not use this value internally for anything. It is strongly recommended to use the newer Fingerprint property for future implementations. That value is automatically calculated by Tekla Structures for all inserted shapes and is used internally for shape identification.
Guid
 A unique identifier of the actual shape, given initially by the ShapeCatalog. This GUID is used as the body of the filename for the shape information found in the Shape directory
HandlePoints
 Defines handle points of the shape.
IsSolid
 Set to true if the shape is detected by TS Core to be a valid solid
Name
 The shape Name
ShapeFacetedBrep
 The data structure containing the geometric information of the shape as a FacetedBRep
UpAxis
 The direction defining what is understood as "up" in the shape that the API user is providing. Typically this is the z-axis, if the data is in global coordinates, coming from a system where Z-axis points to global up direction. Possible values are: Undefined = 0, X_Axis = 1, Y_Axis = 2, Z_Axis = 3. It is highly recommendable to orient shapes in the Tekla Structures native way, that is x-axis on the extrusion line and Y-axis pointing up. NOTE: Specifying UpAxis to be ShapeUpAxis.Undefined may throw a ‘System.ArgumentOutOfRangeException’ exception in certain operations, because the system can not proceed without that information.
Top
See Also
Reference
ShapeItem Class
Tekla.Structures.Catalogs Namespace